tap "drud/ddev"
tap "dvessel/oetools"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "local/versions"
# Archival front-end
brew "atool"
# Basis Universal GPU texture codec command-line compression tool
brew "basis_universal"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Insanely fast image printing in your terminal
brew "catimg"
# Anti-virus software
brew "clamav"
# Cross-platform make
brew "cmake"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# In-depth comparison of files, archives, and directories
brew "diffoscope"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Generate documentation for several programming languages
brew "doxygen"
# Useful examples at the command-line
brew "eg-examples"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU database manager
brew "gdbm"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Small git utilities
brew "git-extras"
# Image processing tools collection
brew "graphicsmagick"
# Command-line tool for generating regular expressions
brew "grex"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Command-line benchmarking tool
brew "hyperfine"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Modular IRC client
brew "irssi"
# Convert JPG images to ASCII
brew "jp2a"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Small build system for use with gyp or CMake
brew "ninja"
# Platform built on V8 to build network applications
brew "node"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Perceptual image comparison tool
brew "perceptualdiff"
# Organize and de-duplicate your files without losing data
brew "periscope"
# PNG image optimizing utility
brew "pngquant"
# Command-line YAML and XML processor that wraps jq
brew "python-yq"
# Cross-platform application and UI framework
brew "qt"
# Tools for Multiple Arcade Machine Emulator
brew "rom-tools"
# Assigns custom icons to webloc files
brew "setweblocthumb"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Manipulate and query tags on macOS files
brew "tag"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Fork of youtube-dl with additional features and fixes
brew "yt-dlp"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# DDEV
brew "drud/ddev/ddev"
# ROM updater and validation tool for OpenEmu's MAME core.
brew "dvessel/oetools/oeadvscan"
# Minimal installer for conda
cask "miniconda"
# Standalone cli for the Soulver calculation engine
cask "soulver-cli"
