#!/bin/zsh
#
# .zsh_plugins.txt - antidote plugins file
#

# The `.zsh_plugins.txt` file is used by antidote to configure Zsh bundles. Bundles are
# just a fancy way of referring to Zsh utilities, frameworks, prompts, or plugins.
#
# NOTE: Order matters in this file! Some bundles need to be last, and others are
# prerequisites. Read the documentation for the plugins you use to ensure proper
# configuration.
#
# Example: https://github.com/getantidote/zdotdir/blob/main/.zsh_plugins.txt

# With antidote, using Zephyr's completion plugin is recommended. This plugin is meant
# to be run near the TOP of your .zsh_plugins.txt file. Includes zsh-users/zsh-completions.
mattmc3/zephyr path:plugins/completion

# Path set to .zsh-theme since it will source multiple otherwise.
romkatv/powerlevel10k path:powerlevel10k.zsh-theme

mattmc3/zephyr path:plugins/zfunctions kind:defer
mattmc3/zephyr path:plugins/macos kind:defer
mattmc3/zman kind:defer

# zsh auto completions.
dvessel/zsh-completion-generator kind:defer
conda-incubator/conda-zsh-completion kind:fpath
keith/zsh-xcode-completions path:src kind:fpath
nilsonholger/osx-zsh-completions kind:fpath

hlissner/zsh-autopair kind:defer
zsh-users/zsh-syntax-highlighting kind:defer
zsh-users/zsh-autosuggestions kind:defer
zsh-users/zsh-history-substring-search kind:defer
Aloxaf/fzf-tab kind:defer
